Here is the job log
```
clembookair:clemenko hobbyfarm ( 54.197.7.6:6443 ) $ kubectl logs -f -n hobbyfarm job-dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k-8mb5v
time="2024-01-04T01:31:44Z" level=info msg="before clone"
time="2024-01-04T01:31:44Z" level=info msg="Output from git clone []"
time="2024-01-04T01:31:44Z" level=info msg="Output from git checkout []"
time="2024-01-04T01:31:44Z" level=info msg="before config"

Initializing the backend...

Successfully configured the backend "kubernetes"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.31.0...
- Installed hashicorp/aws v5.31.0 (self-signed, key ID 34365D9472D7468F)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/plugins/signing.html

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* hashicorp/aws: version = "~> 5.31.0"


Warning: Interpolation-only expressions are deprecated

  on main.tf line 47, in resource "aws_instance" "instance":
  47:   vpc_security_group_ids      = ["${var.vpc_security_group_id}"]

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

Terraform has been successfully initialized!

Initializing the backend...

Successfully configured the backend "kubernetes"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.31.0...
- Installed hashicorp/aws v5.31.0 (self-signed, key ID 34365D9472D7468F)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/plugins/signing.html

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* hashicorp/aws: version = "~> 5.31.0"


Warning: Interpolation-only expressions are deprecated

  on main.tf line 47, in resource "aws_instance" "instance":
  47:   vpc_security_group_ids      = ["${var.vpc_security_group_id}"]

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

Terraform has been successfully initialized!
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.instance will be created
  + resource "aws_instance" "instance" {
      + ami                                  = "ami-08f362c39d03a4eb5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "c6a.2xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "dynamic-62ozofehzb-1b6dcb20-keypair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0ca6bea3c0d18b6f3"
      + tags                                 = {
          + "Name"        = "dynamic-62ozofehzb-1b6dcb20"
          + "Owner"       = "hobbyfarm"
          + "provisioner" = "terraform"
        }
      + tags_all                             = {
          + "Name"        = "dynamic-62ozofehzb-1b6dcb20"
          + "Owner"       = "hobbyfarm"
          + "provisioner" = "terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "2e3f5ff3eafc310dce3b2783acaf8466d1477dab"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0c87eb1835fdbb24f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }
    }

  # aws_key_pair.instance_keypair will be created
  + resource "aws_key_pair" "instance_keypair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "dynamic-62ozofehzb-1b6dcb20-keypair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCkiYvGp8yIVr5WJazqJ+6F0ORIt5IWsjIZlfWYPbLjacndikUo/gK1ivqTF2wgeRb0vZ6zefD71/PupNkxCch71NxoFECulrhQpZ9ALHya6vrxVhIhRP+Fq6qq9YusucDUINsRKohXHm4faiCNpickdrFGzKPhIGaHm4dvz2AYSwkA+dR+HFzH+VhcOQNuSYvU5W5YOan0FIRojiMzsxOdt0WklUlI8lM9TNURcaBtVKKTkPstKYXDXb/HUm4AmUy0hZo7D7VkA/lmpV7gx04E0daTZCICLg1oA196bi+qlmPnEF6a5L/IvB5MBxAHsW8ztdEcF9dHRG+6CZrJcX2X"
      + tags_all        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hostname   = (known after apply)
  + private_ip = (known after apply)
  + public_ip  = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "cloud-config" but a value
was found in file
"dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k.auto.tfvars.json". To use this
value, add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "cred_secret" but a value
was found in file
"dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k.auto.tfvars.json". To use this
value, add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "executor_image" but a value
was found in file
"dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k.auto.tfvars.json". To use this
value, add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Values for undeclared variables

In addition to the other similar warnings shown, 3 other variable(s) defined
without being declared.


Warning: Interpolation-only expressions are deprecated

  on main.tf line 47, in resource "aws_instance" "instance":
  47:   vpc_security_group_ids      = ["${var.vpc_security_group_id}"]

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.instance will be created
  + resource "aws_instance" "instance" {
      + ami                                  = "ami-08f362c39d03a4eb5"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "c6a.2xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "dynamic-62ozofehzb-1b6dcb20-keypair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0ca6bea3c0d18b6f3"
      + tags                                 = {
          + "Name"        = "dynamic-62ozofehzb-1b6dcb20"
          + "Owner"       = "hobbyfarm"
          + "provisioner" = "terraform"
        }
      + tags_all                             = {
          + "Name"        = "dynamic-62ozofehzb-1b6dcb20"
          + "Owner"       = "hobbyfarm"
          + "provisioner" = "terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "2e3f5ff3eafc310dce3b2783acaf8466d1477dab"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0c87eb1835fdbb24f",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }
    }

  # aws_key_pair.instance_keypair will be created
  + resource "aws_key_pair" "instance_keypair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "dynamic-62ozofehzb-1b6dcb20-keypair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCkiYvGp8yIVr5WJazqJ+6F0ORIt5IWsjIZlfWYPbLjacndikUo/gK1ivqTF2wgeRb0vZ6zefD71/PupNkxCch71NxoFECulrhQpZ9ALHya6vrxVhIhRP+Fq6qq9YusucDUINsRKohXHm4faiCNpickdrFGzKPhIGaHm4dvz2AYSwkA+dR+HFzH+VhcOQNuSYvU5W5YOan0FIRojiMzsxOdt0WklUlI8lM9TNURcaBtVKKTkPstKYXDXb/HUm4AmUy0hZo7D7VkA/lmpV7gx04E0daTZCICLg1oA196bi+qlmPnEF6a5L/IvB5MBxAHsW8ztdEcF9dHRG+6CZrJcX2X"
      + tags_all        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hostname   = (known after apply)
  + private_ip = (known after apply)
  + public_ip  = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "cloud-config" but a value
was found in file
"dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k.auto.tfvars.json". To use this
value, add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "cred_secret" but a value
was found in file
"dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k.auto.tfvars.json". To use this
value, add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "executor_image" but a value
was found in file
"dynamic-62ozofehzb-1b6dcb20-tfs-a03cc7b7-tcv4k.auto.tfvars.json". To use this
value, add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Values for undeclared variables

In addition to the other similar warnings shown, 3 other variable(s) defined
without being declared.


Warning: Interpolation-only expressions are deprecated

  on main.tf line 47, in resource "aws_instance" "instance":
  47:   vpc_security_group_ids      = ["${var.vpc_security_group_id}"]

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


time="2024-01-04T01:31:52Z" level=info msg="We have autoConfirm, running apply"
aws_key_pair.instance_keypair: Creating...
aws_key_pair.instance_keypair: Creation complete after 0s [id=dynamic-62ozofehzb-1b6dcb20-keypair]
aws_instance.instance: Creating...
aws_instance.instance: Still creating... [10s elapsed]
aws_instance.instance: Creation complete after 16s [id=i-01c72b507902cad93]

Warning: Interpolation-only expressions are deprecated

  on main.tf line 47, in resource "aws_instance" "instance":
  47:   vpc_security_group_ids      = ["${var.vpc_security_group_id}"]

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

hostname = ec2-3-91-181-15.compute-1.amazonaws.com
private_ip = 172.31.95.193
public_ip = 3.91.181.15
{
  "hostname": {
    "sensitive": false,
    "type": "string",
    "value": "ec2-3-91-181-15.compute-1.amazonaws.com"
  },
  "private_ip": {
    "sensitive": false,
    "type": "string",
    "value": "172.31.95.193"
  },
  "public_ip": {
    "sensitive": false,
    "type": "string",
    "value": "3.91.181.15"
  }
}
```

From : https://github.com/clemenko/tf-module-aws/blob/patch-1/main.tf

based on : https://github.com/hobbyfarm/hf-shim-operator/blob/7985f0076f075f4d5f5e1a3e884fd3d2fd9e8623/pkg/controllers/aws_interface.go#L92

ANY guidance would be helpful. 